# 2. DataFrame

### Create DataFrames

In [541]:
import numpy as np
import pandas as pd

In [542]:
### dataframe from lists; data manipulation
## list of name, degree, score in a course # https://www.geeksforgeeks.org/create-a-pandas-dataframe-from-lists/
name = ["Dakota", "Lucy", "Nathan", "Luke"]
program = ["MBA", "BIST", "MSIT", "MBA"]
score = [90, 88, 77, 99]
 
## lists ==> dictionary
dict = {'name': name, 'degree': program, 'score': score} 

## dictionary ==> dataframe
df = pd.DataFrame(dict)
df
# print(df)

     name degree  score
0  Dakota    MBA     90
1    Lucy   BIST     88
2  Nathan   MSIT     77
3    Luke    MBA     99

In [543]:
### array 
arr_2 = np.random.randint(10, 50, size = (2,3))
arr_2

array([[48, 36, 10],
       [14, 42, 22]])

In [544]:
### array ==> dataframe use DataFrame constructor
df_1 = pd.DataFrame(arr_2, ['A', 'B'], ['C', 'D', 'E'])
df_1

    C   D   E
A  48  36  10
B  14  42  22

In [545]:
dict_3 = {
    'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']), 
    'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd']),
         }
df_2 = pd.DataFrame(dict_3)
df_2
# print(df_2)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [546]:
### pd.DataFrame.from_dict() ==> dataframe
# pd.DataFrame.from_dict(dict([ ('A', [1,2,3]), ('B', [4,5,6]) ]), orient='index', columns=['one', 'two', 'three'])
# something = pd.DataFrame.from_dict(dict([ ('A', [1,2,3]), ('B', [4,5,6]) ]), orient='index', columns=['one', 'two', 'three'])

dict = { 'A': [1,2,3], 'B': [4, 5, 6]}
pd.DataFrame.from_dict(dict, orient='index', columns=['one', 'two', 'three'])

   one  two  three
A    1    2      3
B    4    5      6

In [547]:
### shape
df_1.shape

(2, 3)

### Editing and Retrieving Data

In [548]:
df_1

    C   D   E
A  48  36  10
B  14  42  22

#### Retrieving data

In [549]:
### retrieve data
print(df_1['C'], '\n')
print(df_1[[ 'C', 'E']], '\n')
print(df_1.loc['A'], '\n')
print(df_1.iloc[1], '\n')
print(df_1.loc['A', 'C'], '\n')
print(df_1.loc[['A', 'B'], ['C', 'D']])

A    48
B    14
Name: C, dtype: int64

    C   E
A  48  10
B  14  22

C    48
D    36
E    10
Name: A, dtype: int64

C    14
D    42
E    22
Name: B, dtype: int64

48

    C   D
A  48  36
B  14  42

#### add column

In [550]:
### add column
df_1["Total"] = df_1['C'] + df_1['D'] + df_1['E']
df_1

    C   D   E  Total
A  48  36  10     94
B  14  42  22     78

In [551]:
print(df_2, '\n')
df_2['mult'] = df_2['one'] * df_2['two']
df_2

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

   one  two  mult
a  1.0  1.0   1.0
b  2.0  2.0   4.0
c  3.0  3.0   9.0
d  NaN  4.0   NaN

#### add index

In [552]:
print(df_1)
df_1['Sex'] = ['Men', 'Women']
df_1.set_index('Sex', inplace=True)

    C   D   E  Total
A  48  36  10     94
B  14  42  22     78

#### add row

In [553]:
### add row
dict_2 = {'C': 44, 'D': 45, 'E': 46}
new_row = pd.Series(dict_2, name = 'F')
print(new_row)
new_row= new_row.to_frame().T   ### T: transpose
print(new_row)
# df_1 = df_1.append(new_row)   ### append is deprecated in Pandas in 2.0
df_1 = pd.concat([df_1, new_row])

C    44
D    45
E    46
Name: F, dtype: int64
    C   D   E
F  44  45  46

In [554]:
df_1

        C   D   E  Total
Men    48  36  10   94.0
Women  14  42  22   78.0
F      44  45  46    NaN

In [555]:
### delete row
df_1.drop('Women', axis = 0)

      C   D   E  Total
Men  48  36  10   94.0
F    44  45  46    NaN

#### delete column

In [556]:
df_1.drop('Total', axis=1)
# df_1.drop('Total', axis=1, inplace=True) ### need inplace=True to delete data

        C   D   E
Men    48  36  10
Women  14  42  22
F      44  45  46

#### assign()

In [561]:
df_2

   one  two  mult
a  1.0  1.0   1.0
b  2.0  2.0   4.0
c  3.0  3.0   9.0
d  NaN  4.0   NaN

In [560]:
df_2.assign(div=df_2['one'] / df_2['two'])

   one  two  mult  div
a  1.0  1.0   1.0  1.0
b  2.0  2.0   4.0  1.0
c  3.0  3.0   9.0  1.0
d  NaN  4.0   NaN  NaN

#### reset index

In [557]:
# print(df_1)
# df_1 = df_1.reset_index()
print(df_1)

        C   D   E  Total
Men    48  36  10   94.0
Women  14  42  22   78.0
F      44  45  46    NaN

In [558]:
df_1.reset_index()

   index   C   D   E  Total
0    Men  48  36  10   94.0
1  Women  14  42  22   78.0
2      F  44  45  46    NaN